## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J4M6H6NYM2TCS6K6JSD9217K) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-dbDoc.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-dbDoc.html]
aws_s3_object.redirects["/workflows/liquibase-community/run-liquibase-without-launch-scripts.html"]: Refreshing state... [id=/workflows/liquibase-community/run-liquibase-without-launch-scripts.html]
aws_s3_object.redirects["/commands/validate.html"]: Refreshing state... [id=/commands/validate.html]
aws_s3_object.redirects["/concepts/advanced/should-snapshot-data-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/commands/futurerollbacksql.html"]: Refreshing state... [id=/commands/futurerollbacksql.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include.html]
aws_s3_object.redirects["/concepts/xml-format.html"]: Refreshing state... [id=/concepts/xml-format.html]
aws_s3_object.redirects["/change-types/community/create-table.html"]: Refreshing state... [id=/change-types/community/create-table.html]
aws_s3_object.redirects["/commands/config-ref/driver.html"]: Refreshing state... [id=/commands/config-ref/driver.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/organizations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/organizations.html]
aws_s3_object.redirects["/commands/config-ref/outputfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/outputfile-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerChangeLog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-registerChangeLog.html]
aws_s3_object.redirects["/start/release-notes/4.24.0.html"]: Refreshing state... [id=/start/release-notes/4.24.0.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.11.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.11.0.html]
aws_s3_object.redirects["/commands/registerchangelog.html"]: Refreshing state... [id=/commands/registerchangelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks/postgres-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/postgres-reserved-keywords.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-aws-doc-config.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-aws-doc-config.html]
aws_s3_object.redirects["/workflows/liquibase-pro/mysqlgrants.html"]: Refreshing state... [id=/workflows/liquibase-pro/mysqlgrants.html]
aws_s3_object.redirects["/commands/history.html"]: Refreshing state... [id=/commands/history.html]
aws_s3_object.redirects["/change-types/community/load-data.html"]: Refreshing state... [id=/change-types/community/load-data.html]
aws_s3_object.redirects["/feature-flags/readmes/Liquibase Custom Hosts Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Liquibase Custom Hosts Extension.html]
aws_s3_object.redirects["/install/sybase-enterprise.html"]: Refreshing state... [id=/install/sybase-enterprise.html]
aws_s3_object.redirects["/observability"]: Refreshing state... [id=/observability]
aws_s3_object.redirects["/tools-integrations/community-supported/cdi.html"]: Refreshing state... [id=/tools-integrations/community-supported/cdi.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/informix.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/informix.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql-windows-integrated-security.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql-windows-integrated-security.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagr Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flagr Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/command-parameters.html"]: Refreshing state... [id=/commands/command-parameters.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-user-defined-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-user-defined-pattern-check.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/release-notes.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/release-notes.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/concepts/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-list.html]
aws_s3_object.redirects["/commands/quality-checks/checks-scope.html"]: Refreshing state... [id=/commands/quality-checks/checks-scope.html]
aws_s3_object.redirects["/concepts/databasechangelog.html"]: Refreshing state... [id=/concepts/databasechangelog.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-windows.html]
aws_s3_object.redirects["/concepts/advanced/generated-changeset-ids-contains-description.html"]: Refreshing state... [id=/concepts/advanced/generated-changeset-ids-contains-description.html]
aws_s3_object.redirects["/commands/quality-checks/checks-bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/checks-bulk-set.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.18.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.18.0.html]
aws_s3_object.redirects["/commands/rollbackoneupdate.html"]: Refreshing state... [id=/commands/rollbackoneupdate.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migrate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migrate.html]
aws_s3_object.redirects["/commands/quality-checks/checks-disable.html"]: Refreshing state... [id=/commands/quality-checks/checks-disable.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-generate-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-generate-changelog.html]
aws_s3_object.redirects["/concepts/labels.html"]: Refreshing state... [id=/concepts/labels.html]
aws_s3_object.redirects["/concepts/installation/installation-windows.html"]: Refreshing state... [id=/concepts/installation/installation-windows.html]
aws_s3_object.redirects["/tools-integrations/ant/getting-started-liquibase-ant.html"]: Refreshing state... [id=/tools-integrations/ant/getting-started-liquibase-ant.html]
aws_s3_object.redirects["/change-types/community/drop-sequence.html"]: Refreshing state... [id=/change-types/community/drop-sequence.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-future-reserved-keywords.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-catalog-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-catalog-name-parameter.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/object-name-must-not-match.html]
aws_s3_object.redirects["/start/tutorials/amazon-dynamodb/home.html"]: Refreshing state... [id=/start/tutorials/amazon-dynamodb/home.html]
aws_s3_object.redirects["/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelogSyncSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelogSyncSQL.html]
aws_s3_object.redirects["/concepts/changelogs/contexts.html"]: Refreshing state... [id=/concepts/changelogs/contexts.html]
aws_s3_object.redirects["/start/tutorials/neo4j.html"]: Refreshing state... [id=/start/tutorials/neo4j.html]
aws_s3_object.redirects["/dropall.html"]: Refreshing state... [id=/dropall.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include-all.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include-all.html]
aws_s3_object.redirects["/commands/quality-checks/constraint-must-exist.html"]: Refreshing state... [id=/commands/quality-checks/constraint-must-exist.html]
aws_s3_object.redirects["/concepts/yaml-format.html"]: Refreshing state... [id=/concepts/yaml-format.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-label-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-label-check.html]
aws_s3_object.redirects["/secrets-management/hashicorp-vault.html"]: Refreshing state... [id=/secrets-management/hashicorp-vault.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-pattern-check.html]
aws_s3_object.redirects["/commands/rollbackbytag.html"]: Refreshing state... [id=/commands/rollbackbytag.html]
aws_s3_object.redirects["/install/tutorials/vertica.html"]: Refreshing state... [id=/install/tutorials/vertica.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sybase-anywhere.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sybase-anywhere.html]
aws_s3_object.redirects["/change-types/community/output.html"]: Refreshing state... [id=/change-types/community/output.html]
aws_s3_object.redirects["/start/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/commands/community/generatechangelog.html"]: Refreshing state... [id=/commands/community/generatechangelog.html]
aws_s3_object.redirects["/concepts/databasechangeloglock-table.html"]: Refreshing state... [id=/concepts/databasechangeloglock-table.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivate-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-deactivate-changelog.html]
aws_s3_object.redirects["/concepts/advanced/changelog-lock-poll-rate.html"]: Refreshing state... [id=/concepts/advanced/changelog-lock-poll-rate.html]
aws_s3_object.redirects["/start/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/start/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/concepts/advanced/help.html"]: Refreshing state... [id=/concepts/advanced/help.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-run.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-run.html]
aws_s3_object.redirects["/tools-integrations/gradle/getting-started-liquibase-gradle.html"]: Refreshing state... [id=/tools-integrations/gradle/getting-started-liquibase-gradle.html]
aws_s3_object.redirects["/commands/quality-checks/workflows/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/workflows/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/run-on-change.html"]: Refreshing state... [id=/concepts/changelogs/attributes/run-on-change.html]
aws_s3_object.redirects["/start/tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/start/tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.2-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.2-upgrade-guide.html]
aws_s3_object.redirects["/start/tutorials/mongodb/using-mongosh-changelog.html"]: Refreshing state... [id=/start/tutorials/mongodb/using-mongosh-changelog.html]
aws_s3_object.redirects["/concepts/advanced/output-file-encoding.html"]: Refreshing state... [id=/concepts/advanced/output-file-encoding.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.21.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.21.0.html]
aws_s3_object.redirects["/concepts/advanced/logfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/logfile-parameter.html]
aws_s3_object.redirects["/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/concepts/databasechangelog-table.html"]: Refreshing state... [id=/concepts/databasechangelog-table.html]
aws_s3_object.redirects["/install/tutorials/snowflake.html"]: Refreshing state... [id=/install/tutorials/snowflake.html]
aws_s3_object.redirects["/install/tutorials/teradata.html"]: Refreshing state... [id=/install/tutorials/teradata.html]
aws_s3_object.redirects["/what-is-a-jdbc-url.html"]: Refreshing state... [id=/what-is-a-jdbc-url.html]
aws_s3_object.redirects["/tools-integrations/remote-files/s3-commands.html"]: Refreshing state... [id=/tools-integrations/remote-files/s3-commands.html]
aws_s3_object.redirects["/start/install/tutorials/yugabytedb.html"]: Refreshing state... [id=/start/install/tutorials/yugabytedb.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/interbase.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/interbase.html]
aws_s3_object.redirects["/commands/dbdoc.html"]: Refreshing state... [id=/commands/dbdoc.html]
aws_s3_object.redirects["/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html"]: Refreshing state... [id=/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/ff4j-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/ff4j-feature-flags-extension.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/change-types/community/drop-index.html"]: Refreshing state... [id=/change-types/community/drop-index.html]
aws_s3_object.redirects["/commands/changelogsync.html"]: Refreshing state... [id=/commands/changelogsync.html]
aws_s3_object.redirects["/commands/liquibase-start/home.html"]: Refreshing state... [id=/commands/liquibase-start/home.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-schema-name-parameter.html"]: Refreshing state... [id=/commands/config-ref/liquibase-schema-name-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync.html]
aws_s3_object.redirects["/concepts/installation/installation-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/installation-linux-unix-mac.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdate.html]
aws_s3_object.redirects["/commands/quality-checks/bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/bulk-set.html]
aws_s3_object.redirects["/commands/tagexists.html"]: Refreshing state... [id=/commands/tagexists.html]
aws_s3_object.redirects["/commands/releaselocks.html"]: Refreshing state... [id=/commands/releaselocks.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/home.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/home.html]
aws_s3_object.redirects["/change-types/community/create-view.html"]: Refreshing state... [id=/change-types/community/create-view.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.13.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.13.0.html]
aws_s3_object.redirects["/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-future-rollback-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-future-rollback-sql.html]
aws_s3_object.redirects["/concepts/advanced/outputfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/outputfile-parameter.html]
aws_s3_object.redirects["/commands/community/updatetestingrollback.html"]: Refreshing state... [id=/commands/community/updatetestingrollback.html]
aws_s3_object.redirects["/pro-extensions.html"]: Refreshing state... [id=/pro-extensions.html]
aws_s3_object.redirects["/commands/change-tracking/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/change-tracking/mark-next-changeset-ran.html]
aws_s3_object.redirects["/change-types/pro/rename-trigger.html"]: Refreshing state... [id=/change-types/pro/rename-trigger.html]
aws_s3_object.redirects["/start/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/start/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/commands/update/drop-all.html"]: Refreshing state... [id=/commands/update/drop-all.html]
aws_s3_object.redirects["/tools-integrations/observability/operation-reports-update-report.html"]: Refreshing state... [id=/tools-integrations/observability/operation-reports-update-report.html]
aws_s3_object.redirects["/commands/liquibase-start/init-hub.html"]: Refreshing state... [id=/commands/liquibase-start/init-hub.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-linux-macos.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-delete.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-delete.html]
aws_s3_object.redirects["/change-types/community/update.html"]: Refreshing state... [id=/change-types/community/update.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-databases.html]
aws_s3_object.redirects["/commands/update/validate.html"]: Refreshing state... [id=/commands/update/validate.html]
aws_s3_object.redirects["/commands/liquibase-start/init-project.html"]: Refreshing state... [id=/commands/liquibase-start/init-project.html]
aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"]: Refreshing state... [id=/workflows/liquibase-community/modify-sql.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-liquibase-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-liquibase-with-spinnaker.html]
aws_s3_object.redirects["/commands/config-ref/diff-column-order.html"]: Refreshing state... [id=/commands/config-ref/diff-column-order.html]
aws_s3_object.redirects["/change-types/community/custom-change.html"]: Refreshing state... [id=/change-types/community/custom-change.html]
aws_s3_object.redirects["/concepts/basic/home.html"]: Refreshing state... [id=/concepts/basic/home.html]
aws_s3_object.redirects["/start/tutorials/db2onz.html"]: Refreshing state... [id=/start/tutorials/db2onz.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsql.html]
aws_s3_object.redirects["/commands/changelogsynctotagsql.html"]: Refreshing state... [id=/commands/changelogsynctotagsql.html]
aws_s3_object.redirects["/install/tutorials/hsqldb.html"]: Refreshing state... [id=/install/tutorials/hsqldb.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/rollbackdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/rollbackdatabase.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-revoke-warn.html]
aws_s3_object.redirects["/commands/maintenance/tag-exists.html"]: Refreshing state... [id=/commands/maintenance/tag-exists.html]
aws_s3_object.redirects["/start/install/tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/start/install/tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/commands/change-tracking/set-labels.html"]: Refreshing state... [id=/commands/change-tracking/set-labels.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-check.html]
aws_s3_object.redirects["/start/install/tutorials/cassandra.html"]: Refreshing state... [id=/start/install/tutorials/cassandra.html]
aws_s3_object.redirects["/database-reports.html"]: Refreshing state... [id=/database-reports.html]
aws_s3_object.redirects["/commands/quality-checks/configuring-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/configuring-quality-checks.html]
aws_s3_object.redirects["/commands/community/snapshot.html"]: Refreshing state... [id=/commands/community/snapshot.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql-attribute.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql-attribute.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/voltdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/voltdb.html]
aws_s3_object.redirects["/parameters/command-parameters.html"]: Refreshing state... [id=/parameters/command-parameters.html]
aws_s3_object.redirects["/concepts/advanced/logicalfilepath.html"]: Refreshing state... [id=/concepts/advanced/logicalfilepath.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/includeall.html"]: Refreshing state... [id=/concepts/changelogs/attributes/includeall.html]
aws_s3_object.redirects["/concepts/changelogs/includeall.html"]: Refreshing state... [id=/concepts/changelogs/includeall.html]
aws_s3_object.redirects["/commands/quality-checks/disable.html"]: Refreshing state... [id=/commands/quality-checks/disable.html]
aws_s3_object.redirects["/start/tutorials/vertica.html"]: Refreshing state... [id=/start/tutorials/vertica.html]
aws_s3_object.redirects["/change-types/community/drop-procedure.html"]: Refreshing state... [id=/change-types/community/drop-procedure.html]
aws_s3_object.redirects["/install/tutorials/postgresql.html"]: Refreshing state... [id=/install/tutorials/postgresql.html]
aws_s3_object.redirects["/commands/community/rollbackcountsql.html"]: Refreshing state... [id=/commands/community/rollbackcountsql.html]
aws_s3_object.redirects["/concepts/advanced/driver.html"]: Refreshing state... [id=/concepts/advanced/driver.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-sqlcmd-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-sqlcmd-integration.html]
aws_s3_object.redirects["/tools-integrations/ant/home.html"]: Refreshing state... [id=/tools-integrations/ant/home.html]
aws_s3_object.redirects["/concepts/basic/databasechangelog-table.html"]: Refreshing state... [id=/concepts/basic/databasechangelog-table.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-linux-macos.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/dbdoc.html"]: Refreshing state... [id=/tools-integrations/ant/commands/dbdoc.html]
aws_s3_object.redirects["/concepts/basic/yaml-format.html"]: Refreshing state... [id=/concepts/basic/yaml-format.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/changelogsynctotag.html"]: Refreshing state... [id=/tools-integrations/ant/commands/changelogsynctotag.html]
aws_s3_object.redirects["/commands/docs/db-doc.html"]: Refreshing state... [id=/commands/docs/db-doc.html]
aws_s3_object.redirects["/change-types/community/alter-sequence.html"]: Refreshing state... [id=/change-types/community/alter-sequence.html]
aws_s3_object.redirects["/databases.html"]: Refreshing state... [id=/databases.html]
aws_s3_object.redirects["/tools-integrations/community-supported/home.html"]: Refreshing state... [id=/tools-integrations/community-supported/home.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/setup.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/setup.html]
aws_s3_object.redirects["/commands/marknextchangesetransql.html"]: Refreshing state... [id=/commands/marknextchangesetransql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cloud-spanner.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cloud-spanner.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/updatedatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/updatedatabase.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-synchub.html]
aws_s3_object.redirects["/start/install/tutorials/cassandra-astra.html"]: Refreshing state... [id=/start/install/tutorials/cassandra-astra.html]
aws_s3_object.redirects["/concepts/other-formats.html"]: Refreshing state... [id=/concepts/other-formats.html]
aws_s3_object.redirects["/concepts/basic/how-liquibase-finds-files.html"]: Refreshing state... [id=/concepts/basic/how-liquibase-finds-files.html]
aws_s3_object.redirects["/workflows/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/workflows/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/concepts/basic/databasechangeloglock-table.html"]: Refreshing state... [id=/concepts/basic/databasechangeloglock-table.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.8.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.8.0.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.9.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.9.1.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-specific-privs-warn.html]
aws_s3_object.redirects["/commands/community/diff.html"]: Refreshing state... [id=/commands/community/diff.html]
aws_s3_object.redirects["/concepts/advanced/runonchange.html"]: Refreshing state... [id=/concepts/advanced/runonchange.html]
aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"]: Refreshing state... [id=/tools-integrations/observability/meta-data-structured-logs.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-pro-certified-databases.html"]: Refreshing state... [id=/concepts/advanced/liquibase-pro-certified-databases.html]
aws_s3_object.redirects["/commands/status/history.html"]: Refreshing state... [id=/commands/status/history.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-windows.html]
aws_s3_object.redirects["/commands/community/snapshotreference.html"]: Refreshing state... [id=/commands/community/snapshotreference.html]
aws_s3_object.redirects["/start/tutorials/postgresql.html"]: Refreshing state... [id=/start/tutorials/postgresql.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-windows.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sqlite.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sqlite.html]
aws_s3_object.redirects["/start/tutorials/informix.html"]: Refreshing state... [id=/start/tutorials/informix.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb.html]
aws_s3_object.redirects["/install/home.html"]: Refreshing state... [id=/install/home.html]
aws_s3_object.redirects["/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html"]: Refreshing state... [id=/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-macos.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-releaseLocks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-releaseLocks.html]
aws_s3_object.redirects["/commands/quality-checks/customize.html"]: Refreshing state... [id=/commands/quality-checks/customize.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/home.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/home.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/marknextchangesetran.html"]: Refreshing state... [id=/tools-integrations/ant/commands/marknextchangesetran.html]
aws_s3_object.redirects["/commands/config-ref/changelogfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/changelogfile-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-dropAll.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-dropAll.html]
aws_s3_object.redirects["/commands/config-ref/include-system-classpath-parameter.html"]: Refreshing state... [id=/commands/config-ref/include-system-classpath-parameter.html]
aws_s3_object.redirects["/commands/community/diffchangelog.html"]: Refreshing state... [id=/commands/community/diffchangelog.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-db-doc.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-db-doc.html]
aws_s3_object.redirects["/change-types/community/add-default-value.html"]: Refreshing state... [id=/change-types/community/add-default-value.html]
aws_s3_object.redirects["/tools-integrations/maven/using-liquibase-and-maven-pom-file.html"]: Refreshing state... [id=/tools-integrations/maven/using-liquibase-and-maven-pom-file.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsqldb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsqldb.html]
aws_s3_object.redirects["/commands/updatesql.html"]: Refreshing state... [id=/commands/updatesql.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-windows.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/workflows/liquibase-pro/mariadbgrants.html"]: Refreshing state... [id=/workflows/liquibase-pro/mariadbgrants.html]
aws_s3_object.redirects["/parameters/logical-file-path.html"]: Refreshing state... [id=/parameters/logical-file-path.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql.html]
aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/hashicorp-vault.html"]: Refreshing state... [id=/tools-integrations/extensions/secrets-management/hashicorp-vault.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/commands/generatechangelog.html"]: Refreshing state... [id=/commands/generatechangelog.html]
aws_s3_object.redirects["/tools-integrations/labs/shell-commands.html"]: Refreshing state... [id=/tools-integrations/labs/shell-commands.html]
aws_s3_object.redirects["/commands/diff.html"]: Refreshing state... [id=/commands/diff.html]
aws_s3_object.redirects["/commands/community/quality-checks/generic-object.html"]: Refreshing state... [id=/commands/community/quality-checks/generic-object.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/diffdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/diffdatabase.html]
aws_s3_object.redirects["/commands/maintenance/drop-all.html"]: Refreshing state... [id=/commands/maintenance/drop-all.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml.html]
aws_s3_object.redirects["/commands/community/rollbacktodatesql.html"]: Refreshing state... [id=/commands/community/rollbacktodatesql.html]
aws_s3_object.redirects["/start/install/tutorials/mssql.html"]: Refreshing state... [id=/start/install/tutorials/mssql.html]
aws_s3_object.redirects["/start/install/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/install/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/operation-reports.html"]: Refreshing state... [id=/operation-reports.html]
aws_s3_object.redirects["/tools-integrations/maven/workflows/using-liquibase-maven-plugin-and-springboot.html"]: Refreshing state... [id=/tools-integrations/maven/workflows/using-liquibase-maven-plugin-and-springboot.html]
aws_s3_object.redirects["/install/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/install/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-windows.html]
aws_s3_object.redirects["/tools-integrations/native-executors/mongodb-mongosh.html"]: Refreshing state... [id=/tools-integrations/native-executors/mongodb-mongosh.html]
aws_s3_object.redirects["/change-types/community/sql.html"]: Refreshing state... [id=/change-types/community/sql.html]
aws_s3_object.redirects["/change-types/column.html"]: Refreshing state... [id=/change-types/column.html]
aws_s3_object.redirects["/change-types/pro/drop-function.html"]: Refreshing state... [id=/change-types/pro/drop-function.html]
aws_s3_object.redirects["/change-types/community/tag-database.html"]: Refreshing state... [id=/change-types/community/tag-database.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.15.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.15.0.html]
aws_s3_object.redirects["/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/documentation/labels.html"]: Refreshing state... [id=/documentation/labels.html]
aws_s3_object.redirects["/commands/java-opts-environment-variable.html"]: Refreshing state... [id=/commands/java-opts-environment-variable.html]
aws_s3_object.redirects["/databasechangeloghistory"]: Refreshing state... [id=/databasechangeloghistory]
aws_s3_object.redirects["/concepts/changes/faq.html"]: Refreshing state... [id=/concepts/changes/faq.html]
aws_s3_object.redirects["/install/liquibase-requirements.html"]: Refreshing state... [id=/install/liquibase-requirements.html]
aws_s3_object.redirects["/change-types/community/drop-default-value.html"]: Refreshing state... [id=/change-types/community/drop-default-value.html]
aws_s3_object.redirects["/feature-flags/overview.html"]: Refreshing state... [id=/feature-flags/overview.html]
aws_s3_object.redirects["/commands/quality-checks/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/secrets-management/home.html"]: Refreshing state... [id=/secrets-management/home.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-linux-macos.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hibernate.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hibernate.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html]
aws_s3_object.redirects["/tools-integrations/labs/variables.html"]: Refreshing state... [id=/tools-integrations/labs/variables.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-windows.html]
aws_s3_object.redirects["/commands/tag.html"]: Refreshing state... [id=/commands/tag.html]
aws_s3_object.redirects["/commands/updatetestingrollback.html"]: Refreshing state... [id=/commands/updatetestingrollback.html]
aws_s3_object.redirects["/concepts/advanced/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/concepts/advanced/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/change-types/community/create-procedure.html"]: Refreshing state... [id=/change-types/community/create-procedure.html]
aws_s3_object.redirects["/workflows/liquibase-community/generating-docs.html"]: Refreshing state... [id=/workflows/liquibase-community/generating-docs.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/devops-metrics.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/devops-metrics.html]
aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/home.html"]: Refreshing state... [id=/tools-integrations/extensions/secrets-management/home.html]
aws_s3_object.redirects["/concepts/advanced/includeall.html"]: Refreshing state... [id=/concepts/advanced/includeall.html]
aws_s3_object.redirects["/concepts/basic/changeset.html"]: Refreshing state... [id=/concepts/basic/changeset.html]
aws_s3_object.redirects["/commands/pro/rollback-one-changeset.html"]: Refreshing state... [id=/commands/pro/rollback-one-changeset.html]
aws_s3_object.redirects["/concepts/advanced/diff-column-order.html"]: Refreshing state... [id=/concepts/advanced/diff-column-order.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-amazon-documentdb.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-amazon-documentdb.html]
aws_s3_object.redirects["/feature-flags/readmes/FF4J Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/FF4J Feature Flags Extension.html]
aws_s3_object.redirects["/install/tutorials/bigquery.html"]: Refreshing state... [id=/install/tutorials/bigquery.html]
aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/tools-integrations/extensions/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/start/install/tutorials/hibernate.html"]: Refreshing state... [id=/start/install/tutorials/hibernate.html]
aws_s3_object.redirects["/install/tutorials/aws-redshift.html"]: Refreshing state... [id=/install/tutorials/aws-redshift.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-sql-plus-integration.html]
aws_s3_object.redirects["/concepts/changelogs/changelog-formats.html"]: Refreshing state... [id=/concepts/changelogs/changelog-formats.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync-sql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.7.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.7.1.html]
aws_s3_object.redirects["/parameters/objectquotingstrategy.html"]: Refreshing state... [id=/parameters/objectquotingstrategy.html]
aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-report.html"]: Refreshing state... [id=/tools-integrations/observability/operation-reports-checks-report.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/flagr-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/flagr-feature-flags-extension.html]
aws_s3_object.redirects["/commands/pro/rollbackonechangesetsql.html"]: Refreshing state... [id=/commands/pro/rollbackonechangesetsql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-clearCheckSums.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-clearCheckSums.html]
aws_s3_object.redirects["/DATABASECHANGELOGHISTORY"]: Refreshing state... [id=/DATABASECHANGELOGHISTORY]
aws_s3_object.redirects["/start/install/tutorials/mysql.html"]: Refreshing state... [id=/start/install/tutorials/mysql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/searchpath.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/searchpath.html]
aws_s3_object.redirects["/commands/diff/diff-changelog.html"]: Refreshing state... [id=/commands/diff/diff-changelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks-customize.html"]: Refreshing state... [id=/commands/quality-checks/checks-customize.html]
aws_s3_object.redirects["/start/install/tutorials/voltdb.html"]: Refreshing state... [id=/start/install/tutorials/voltdb.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-sql.html]
aws_s3_object.redirects["/commands/community/diff-json.html"]: Refreshing state... [id=/commands/community/diff-json.html]
aws_s3_object.redirects["/commands/quality-checks/checks/postgres-non-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/postgres-non-reserved-keywords.html]
aws_s3_object.redirects["/concepts/advanced/runwith.html"]: Refreshing state... [id=/concepts/advanced/runwith.html]
aws_s3_object.redirects["/commands/liquibase-environment-variables.html"]: Refreshing state... [id=/commands/liquibase-environment-variables.html]
aws_s3_object.redirects["/concepts/changes/home.html"]: Refreshing state... [id=/concepts/changes/home.html]
aws_s3_object.redirects["/change-types/community/modify-data-type.html"]: Refreshing state... [id=/change-types/community/modify-data-type.html]
aws_s3_object.redirects["/commands/config-ref/logfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/logfile-parameter.html]
aws_s3_object.redirects["/concepts/installation/running-first-update-installer.html"]: Refreshing state... [id=/concepts/installation/running-first-update-installer.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.12.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.12.0.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/db2onz.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/db2onz.html]
aws_s3_object.redirects["/concepts/advanced/include-system-classpath-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-system-classpath-parameter.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran-sql.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran-sql.html]
aws_s3_object.redirects["/commands/community/registerChangeLog.html"]: Refreshing state... [id=/commands/community/registerChangeLog.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/commands/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/concepts/advanced/configuring-quality-checks.html"]: Refreshing state... [id=/concepts/advanced/configuring-quality-checks.html]
aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"]: Refreshing state... [id=/commands/quality-checks/checks/require-chaneset-dis-uuid.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/home.html"]: Refreshing state... [id=/tools-integrations/secrets-management/home.html]
aws_s3_object.redirects["/change-types/community/drop-primary-key.html"]: Refreshing state... [id=/change-types/community/drop-primary-key.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/firebird.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/firebird.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer.html]
aws_s3_object.redirects["/change-types/pro/add-check-constraint.html"]: Refreshing state... [id=/change-types/pro/add-check-constraint.html]
aws_s3_object.redirects["/concepts/changeset.html"]: Refreshing state... [id=/concepts/changeset.html]
aws_s3_object.redirects["/install/tutorials/sap-hana.html"]: Refreshing state... [id=/install/tutorials/sap-hana.html]
aws_s3_object.redirects["/what-is-a-jdbc-url"]: Refreshing state... [id=/what-is-a-jdbc-url]
aws_s3_object.redirects["/commands/community/rollbacktodate.html"]: Refreshing state... [id=/commands/community/rollbacktodate.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.5.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.5.0.html]
aws_s3_object.redirects["/flow.html"]: Refreshing state... [id=/flow.html]
aws_s3_object.redirects["/commands/quality-checks/quality-checks-json-object.html"]: Refreshing state... [id=/commands/quality-checks/quality-checks-json-object.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-atlas-config.html]
aws_s3_object.redirects["/concepts/advanced/column.html"]: Refreshing state... [id=/concepts/advanced/column.html]
aws_s3_object.redirects["/concepts/changelogs/include.html"]: Refreshing state... [id=/concepts/changelogs/include.html]
aws_s3_object.redirects["/concepts/basic/other-formats.html"]: Refreshing state... [id=/concepts/basic/other-formats.html]
aws_s3_object.redirects["/commands/quality-checks/checks-reset.html"]: Refreshing state... [id=/commands/quality-checks/checks-reset.html]
aws_s3_object.redirects["/install/tutorials/cassandra.html"]: Refreshing state... [id=/install/tutorials/cassandra.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-catalog-name-parameter.html"]: Refreshing state... [id=/commands/config-ref/liquibase-catalog-name-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdateSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdateSQL.html]
aws_s3_object.redirects["/commands/community/home.html"]: Refreshing state... [id=/commands/community/home.html]
aws_s3_object.redirects["/concepts/installation/installation-linux-unix-mac-with-maven.html"]: Refreshing state... [id=/concepts/installation/installation-linux-unix-mac-with-maven.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/changelog-attributes.html"]: Refreshing state... [id=/concepts/changelogs/attributes/changelog-attributes.html]
aws_s3_object.redirects["/concepts/advanced/objectquotingstrategy.html"]: Refreshing state... [id=/concepts/advanced/objectquotingstrategy.html]
aws_s3_object.redirects["/concepts/advanced/headless-parameter.html"]: Refreshing state... [id=/concepts/advanced/headless-parameter.html]
aws_s3_object.redirects["/commands/community/status-verbose.html"]: Refreshing state... [id=/commands/community/status-verbose.html]
aws_s3_object.redirects["/documentation/maven/maven_updatetestingrollback.html"]: Refreshing state... [id=/documentation/maven/maven_updatetestingrollback.html]
aws_s3_object.redirects["/change-types/community/empty.html"]: Refreshing state... [id=/change-types/community/empty.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-liquibase-percona-toolkit-extension.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-liquibase-percona-toolkit-extension.html]
aws_s3_object.redirects["/concepts/includeall.html"]: Refreshing state... [id=/concepts/includeall.html]
aws_s3_object.redirects["/start/install/tutorials/sqlite.html"]: Refreshing state... [id=/start/install/tutorials/sqlite.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.0-upgrade-guide.html]
aws_s3_object.redirects["/drift-reports.html"]: Refreshing state... [id=/drift-reports.html]
aws_s3_object.redirects["/commands/init/hub.html"]: Refreshing state... [id=/commands/init/hub.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.6.0-0.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.6.0-0.1.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/cloudbees-feature-management.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/cloudbees-feature-management.html]
aws_s3_object.redirects["/command-line/index.html"]: Refreshing state... [id=/command-line/index.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-linux-macos.html]
aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"]: Refreshing state... [id=/tools-integrations/observability/database-reports.html]
aws_s3_object.redirects["/change-types/community/set-table-remarks.html"]: Refreshing state... [id=/change-types/community/set-table-remarks.html]
aws_s3_object.redirects["/commands/rollbackonechangeset.html"]: Refreshing state... [id=/commands/rollbackonechangeset.html]
aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/working-with-quality-checks.html]
aws_s3_object.redirects["/change-types/community/rename-table.html"]: Refreshing state... [id=/change-types/community/rename-table.html]
aws_s3_object.redirects["/workflows/liquibase-community/setup-gitlab-cicd.html"]: Refreshing state... [id=/workflows/liquibase-community/setup-gitlab-cicd.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-windows.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-list-locks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-list-locks.html]
aws_s3_object.redirects["/install/drivers-extensions.html"]: Refreshing state... [id=/install/drivers-extensions.html]
aws_s3_object.redirects["/concepts/basic/changelog-parameters.html"]: Refreshing state... [id=/concepts/basic/changelog-parameters.html]
aws_s3_object.redirects["/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-sync-hub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-sync-hub.html]
aws_s3_object.redirects["/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/commands/community/unexpectedchangesets.html"]: Refreshing state... [id=/commands/community/unexpectedchangesets.html]
aws_s3_object.redirects["/start/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/start/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/pro-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/pro-quality-checks.html]
aws_s3_object.redirects["/start/tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/start/tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/start/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/commands/community/popular-topics.html"]: Refreshing state... [id=/commands/community/popular-topics.html]
aws_s3_object.redirects["/tools-integrations/remote-files/remote-file-path-rules.html"]: Refreshing state... [id=/tools-integrations/remote-files/remote-file-path-rules.html]
aws_s3_object.redirects["/commands/update.html"]: Refreshing state... [id=/commands/update.html]
aws_s3_object.redirects["/commands/execute-sql.html"]: Refreshing state... [id=/commands/execute-sql.html]
aws_s3_object.redirects["/commands/community/dbdoc.html"]: Refreshing state... [id=/commands/community/dbdoc.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/flow/advance-flow-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/flow/advance-flow-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/advanced-flow-file.html" -> "/liquibase-pro/flow/advanced-flow-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/flow/advanced-flow-file.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/advanced-flow-file.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/advanced-flow-file.html"
    }

  # aws_s3_object.redirects["/commands/flow/conditionals.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/conditionals.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/conditionals.html"
    }

  # aws_s3_object.redirects["/commands/flow/if-conditionals.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/flow/if-conditionals.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/conditionals.html" -> "/liquibase-pro/flow/conditionals.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/flow/shell-commands.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/shell-commands.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/shell-commands.html"
    }

  # aws_s3_object.redirects["/commands/flow/variables.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/variables.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/variables.html"
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/advance-flow-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/advance-flow-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/advanced-flow-file.html" -> "/liquibase-pro/flow/advanced-flow-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/if-conditionals.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/if-conditionals.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/conditionals.html" -> "/liquibase-pro/flow/conditionals.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/shell-commands.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/shell-commands.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/shell-commands.html" -> "/liquibase-pro/flow/shell-commands.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/variables.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/variables.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/variables.html" -> "/liquibase-pro/flow/variables.html"
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 8 to change, 0 to destroy.

[01J4KGWXC951VDMV78CXEK1P9Q] Changes are GO
[01J4KGWXC951VDMV78CXEK1P9Q] Uploading the list of managed resources...
[01J4KGWXC951VDMV78CXEK1P9Q] Generating Infracost JSON report from plan

[01J4KGWXC951VDMV78CXEK1P9Q] Infracost report generated successfully
[01J4KGWXC951VDMV78CXEK1P9Q] Mapping Infracost data to resources
[01J4KGWXC951VDMV78CXEK1P9Q] Costs mapped successfully
[01J4KGWXC951VDMV78CXEK1P9Q] Please be aware that the run changes calculation includes output changes.
[01J4KGWXC951VDMV78CXEK1P9Q] Resource list upload is GO
[01J4KGWXC951VDMV78CXEK1P9Q] Generating JSON representation of the plan...
[01J4KGWXC951VDMV78CXEK1P9Q] JSON representation is GO
[01J4KGWXC951VDMV78CXEK1P9Q] Generating Infracost JSON report from plan

[01J4KGWXC951VDMV78CXEK1P9Q] Infracost report generated successfully
[01J4KGWXC951VDMV78CXEK1P9Q] Loading custom plan policy inputs...
[01J4KGWXC951VDMV78CXEK1P9Q] 0 custom plan policy inputs found
[01J4KGWXC951VDMV78CXEK1P9Q] No plan policies to evaluate
```

</details>